/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   screen_size.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: copihendo <copihendo@student.42.fr>        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/03/14 01:40:26 by copihendo         #+#    #+#             */
/*   Updated: 2021/03/14 02:01:13 by copihendo        ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "cube.h"

ft_screen_size(t_base *base)
{
	// сделать проверку существования аргументов [0-2], если не совпалдает вызвать ft_exit

	base->width_screen = base->junk.lines[1]; 
	base->height_screen = base->junk.lines[2]; 
}

